// подключение библиотеки

#include "BiWheel.h"

// создание объекта для шасси
// аргументы - цифровые пины Arduino,
// к которым подключены IN1, IN2, IN3, IN4 H-моста

biWheel chassis = biWheel(11, 3, 9, 10);


void setup(){} // остаётся пустым

/*
	* Основной метод drive вращает моторы с заданными скоростями.
	* Скорость указывается от 0 до 100 по модулю:
	* 0 - стоп, 100 - максимальная скорость.
	* Отрицательная скорость - мотор вращается назад.
	* Мотор может не крутиться при указании маленькой скорости -
	* это зависит от конкретной модели мотора.
	* После использования метода drive моторы будет продолжать
	* крутиться в указанную сторону с указанной скоростью,
	* пока не будет вызван новый метод с новыми значениями.
*/

void loop(){
		chassis.drive(100,-100); 	//левый мотор вращается вперед с максимальной скоростью
									//правый мотор вращается назад с максимальной скоростью
		delay(2000);				//пауза 2 секунды
		chassis.drive(-80,80);		//левый мотор вращается назад со скоростью 80% от максимальной
									//правый мотор вращается вперед со скоростью 80% от максимальной
		delay(3000);				//пауза 3 секунды
		chassis.drive(0, 0);		//стоп левого и правого мотора
		delay(1000);				//пауза 1 секунда
}
